{
    "шрифт": "Шрифт - это набор установочных файлов с заданными формулами. Благодаря формулам каждая буква имеет определенную форму, объем, высоту, ширину и т.д. Они, как и изображения состоят из опорных точек и соединяющих их кривых (имеют математическое описание), но в этом описании заданы все буквы шрифта и цифры, а также имеется отдельное описания для разных написаний/начертаний одного и того же шрифта",
    "php": "PHP: Hypertext preprocessor – это язык программирования, который используется для разработки серверной части веб-приложений.",
    "javascript": "Интерпретируемый язык программирования, который используется для разработки как клиентской части, так и серверной части веб-приложений.",
    "woff": "Web Open Font Format - расширение формата шрифта OpenType или TrueType со сжатием и полностью совпадающим с оригиналом, что позволяет оставить неизменным механизм отрисовки. Также формат включает дополнительные метаданные, в которые производитель шрифта может включить информацию об использовании шрифта.",
    "ttf": "TrueType - формат компьютерных шрифтов, разработанный фирмой Apple в конце 1980-х годов. Шрифты в данном формате используются во многих современных операционных системах. Файлы с такими шрифтами имеют расширение имени «ttf». ",
    "eot": "Embedded OpenType — компактный формат внедряемых в веб страницы OpenType шрифтов, разработанный Microsoft. Файлы таких шрифтов обычно имеют расширение «.eot».",
    "woff2": "WOFF2 - это файл веб-шрифтов, созданный в формате WOFF (Web Open Font Format) 2.0, открытый формат, используемый для доставки шрифтов веб-страницы «на лету».",
    "gzip": "GZip это утилита сжатия и восстановления (декомпрессии) файлов, использующая алгоритм Deflate. Применяется в основном в UNIX-системах, в ряде которых является стандартом де-факто для сжатия данных.",
    "foit": "FOIT (Flash of Invisible Text) — (Flash of Invisible Text) «мелькание невидимого текста» подразумевается процесс не отображения шрифта до полной его обработки.",
    "fout": "FOUT (Flash of Unstyled Text) «мелькание неоформленного текста» подразумевается процесс где происходит отображения шрифта по умолчанию во время загрузки пользовательского шрифта.",
    "оптимизация": "Оптимизация веб-ресурса подразумевает комплекс мер направленных на улучшения скорости загрузки сайта и продвижению его в интернете",
    "sitemap": "Sitemap.xml это файл в котором содержаться карта сайта в основном для поисковых веб-ресурсов",
    "отказ": "Под отказами понимается случаи, когда посетитель находился на веб-ресурсе менее 30 секунд",
    "ссылочная-масса": "Ссылочная масса – это количество упоминаний, то есть ссылок, направленных на веб-ресурс в сети интернет, не включая ссылки, находящиеся на самом веб-ресурсе",
    "ssl": "Это цифровая подпись сайта, которая нужна для работы протокола защищенной передачи данных в сети. Она обеспечивает шифрованное соединение между пользователем и сайтом. То есть информация, которой они обмениваются, защищена от посторонних — провайдера, оператора, администратора вайфай-сети и прочих. Еще с помощью этого сертификата подтверждается подлинность сайта — пользователь может проверить, какой компании на самом деле принадлежит ресурс.",
    "битая-ссылка ": "Битая ссылка – это ссылка, ведущая на сайт или страницу, которая перестала существовать или имеет кардинально другое содержание",
    "чпу": "человеко-понятный URL",
    "валидация": "Валидация – это проверка документа на соответствие утвержденным веб-стандартам и обнаружение возможных ошибок.",
    "алгоритм": "Алгоритм – это конечная совокупность точно заданных правил решения некоторого класса задач или набор инструкций, описывающих порядок действий исполнителя для решения некоторой задачи. В старой трактовке вместо слова «порядок» использовалось слово «последовательность», но по мере развития параллельности в работе компьютеров слово «последовательность» стали заменять более общим словом «порядок». Независимые инструкции могут выполняться в произвольном порядке, параллельно, если это позволяют используемые исполнители.",
    "блок-схема": "Блок-схема — распространённый тип схем (графических моделей), описывающих алгоритмы или процессы, в которых отдельные шаги изображаются в виде блоков различной формы, соединённых между собой линиями, указывающими направление последовательности.",
    "uml": "UML – унифицированный язык моделирования (Unified Modeling Language) – это система обозначений, которую можно применять для объектно-ориентированного анализа и проектирования. Его можно использовать для визуализации, спецификации, конструирования и документирования программных систем.",
    "кроссбраузерность": "Кроссбраузерность — свойство веб-сайта отображаться и функционировать во всех часто используемых браузерах идентично. Под идентичностью функционирования подразумевается: отсутствие некорректной работы, ошибок в вёрстке и способность отображать материал с одинаковой степенью читабельности. Вследствие постоянного развития веб-технологий, приемлемую кросс-браузерность возможно обеспечить только для последних версий браузеров."
}